In [6]:
import pandas as pd
from matplotlib import pyplot as plt
import seaborn as sns
import numpy as np
from sqlalchemy import create_engine, types
from sqlalchemy import text # to be able to pass string

In [7]:
df_1= pd.read_csv('../data/Raw/World_Marriage_Dataset.csv')

In [8]:
df_1.sample(10)

,Sr.No.,Country,AgeGroup,Sex,MaritalStatus,DataProcess,Data Collection (Start Year),Data Collection (End Year),Data Source
258721,258722,United States of America,[40-44],Woman,Divorced,Estimate,1975,1975,UNSD
103985,103986,Hungary,[25-29],Woman,Single,Estimate,1975,1975,UNSD
183703,183704,Norway,[40-44],Woman,Divorced,Estimate,1997,1997,UNSD
109083,109084,Hungary,[75+],Man,Single,Estimate,2016,2016,UNSD
252182,252183,Uganda,[60+],Man,Divorced or Separated,Census,2002,2002,UNSD
197748,197749,Portugal,[15-19],Woman,Married,Census,2011,2011,UNSD
2773,2774,Angola,[55-59],Woman,Married or Living together,Survey,2001,2001,MICS_HH
106858,106859,Hungary,[75+],Woman,Widowed,Estimate,1999,1999,UNSD
210624,210625,San Marino,[55-59],Man,Single,Estimate,1979,1979,UNSD
228412,228413,Spain,[45-49],Man,Married,Census,2001,2001,UNSD

In [9]:
df_1.drop(columns=["Sr.No."], inplace=True)

In [10]:
df_1

,Country,AgeGroup,Sex,MaritalStatus,DataProcess,Data Collection (Start Year),Data Collection (End Year),Data Source
0,Afghanistan,[15-19],Man,Divorced,Survey,1972,1974,National statistics
1,Afghanistan,[20-24],Man,Divorced,Survey,1972,1974,National statistics
2,Afghanistan,[25-29],Man,Divorced,Survey,1972,1974,National statistics
3,Afghanistan,[30-34],Man,Divorced,Survey,1972,1974,National statistics
4,Afghanistan,[35-39],Man,Divorced,Survey,1972,1974,National statistics
...,...,...,...,...,...,...,...,...
271599,Zimbabwe,[55-59],Woman,Widowed,Survey,2017,2017,National statistics
271600,Zimbabwe,[60-64],Woman,Widowed,Survey,2017,2017,National statistics
271601,Zimbabwe,[65-69],Woman,Widowed,Survey,2017,2017,National statistics
271602,Zimbabwe,[70-74],Woman,Widowed,Survey,2017,2017,National statistics
271603,Zimbabwe,[75+],Woman,Widowed,Survey,2017,2017,National statistics

In [12]:
df_1.columns = df_1.columns.str.lower() \
    .str.replace(' ', '_') \
    .str.replace('(', '') \
    .str.replace(')', '') \
    .str.replace('[^0-9a-zA-Z_]', '', regex=True)

In [13]:
df_1.rename(columns={
    "agegroup": "age_group",
    "maritalstatus": "marital_status",
    "dataprocess": "data_process",
    "Data Collection (Start Year)": "data_collection_start_year",
    "Data Collection (End Year)": "data_collection_end_year",
    "Data Source": "data_source",
    "Country": "country",
    "Sex": "sex"
}, inplace=True)

In [14]:
df_1.sample(5)

,country,age_group,sex,marital_status,data_process,data_collection_start_year,data_collection_end_year,data_source
114607,Iceland,[50-54],Woman,Single,Estimate,2014,2014,UNSD
254961,United Kingdom,[40-44],Man,Widowed,Estimate,1989,1989,UNSD
120207,Ireland,[25-29],Man,Married,Census,1971,1971,UNSD
271590,Zimbabwe,[65-69],Woman,Single,Survey,2017,2017,National statistics
266379,Viet Nam,[45-49],Man,Widowed,Survey,2007,2007,National statistics

In [16]:
df_1.drop_duplicates(inplace=True)
print(df_1.isnull().sum())

country                       0
age_group                     0
sex                           0
marital_status                0
data_process                  0
data_collection_start_year    0
data_collection_end_year      0
data_source                   0
dtype: int64

In [17]:
print(df_1.head())

       country age_group  sex marital_status data_process  \
0  Afghanistan   [15-19]  Man       Divorced       Survey
1  Afghanistan   [20-24]  Man       Divorced       Survey
2  Afghanistan   [25-29]  Man       Divorced       Survey
3  Afghanistan   [30-34]  Man       Divorced       Survey
4  Afghanistan   [35-39]  Man       Divorced       Survey

   data_collection_start_year  data_collection_end_year          data_source
0                        1972                      1974  National statistics
1                        1972                      1974  National statistics
2                        1972                      1974  National statistics
3                        1972                      1974  National statistics
4                        1972                      1974  National statistics

In [19]:
df_1.to_csv("cleaned_world_marriage.csv", index=False)

In [28]:
df_2 = pd.read_csv('../data/Raw/age-at-marriage-women.csv')
df_2.sample(5)

,Entity,Code,Year,Mean age of women at first marriage,1005564-annotations
270,Estonia,EST,2015,29.30,NaN
854,South Korea,KOR,1993,25.01,NaN
217,Denmark,DNK,1991,28.00,NaN
61,Belgium,BEL,1995,25.60,NaN
974,Turkey,TUR,2009,23.70,NaN

In [29]:
df_2.columns = df_2.columns.str.lower() \
    .str.replace(' ', '_') \
    .str.replace('(', '') \
    .str.replace(')', '') \
    .str.replace('[^0-9a-zA-Z_]', '', regex=True)

In [30]:
df_2

,entity,code,year,mean_age_of_women_at_first_marriage,1005564annotations
0,Australia,AUS,1990,24.3,median
1,Australia,AUS,1991,24.5,median
2,Australia,AUS,1992,24.7,median
3,Australia,AUS,1993,24.8,median
4,Australia,AUS,1994,25.1,median
...,...,...,...,...,...
1042,United States,USA,2017,27.4,median
1043,United States,USA,2018,27.8,median
1044,United States,USA,2019,28.0,median
1045,United States,USA,2020,28.1,median
1046,United States,USA,2021,28.6,median

In [31]:
df_2 = df_2.drop(columns=['1005564annotations'])

# Rename long column
df_2.rename(columns={
    "entity": "country",   
}, inplace=True)

# Optional: Save cleaned version
df_2.to_csv("cleaned_age_at_marriage_women.csv", index=False)

In [32]:
df_2

            country code  year  mean_age_of_women_at_first_marriage
0         Australia  AUS  1990                                 24.3
1         Australia  AUS  1991                                 24.5
2         Australia  AUS  1992                                 24.7
3         Australia  AUS  1993                                 24.8
4         Australia  AUS  1994                                 25.1
...             ...  ...   ...                                  ...
1042  United States  USA  2017                                 27.4
1043  United States  USA  2018                                 27.8
1044  United States  USA  2019                                 28.0
1045  United States  USA  2020                                 28.1
1046  United States  USA  2021                                 28.6

[1047 rows x 4 columns]